<a href="https://colab.research.google.com/github/SainiManisha/dbms-tutorial/blob/master/JOINS_and_Basics_Commands_SQLITE.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Draw a database design for a TODO App 
##Design a database for an app that keeps track of TODO lists of its users. 
##In this app a user can:Create a TODO item with some text in it. Add tags to the TODO items, like homework, groceries etc.. Mark a TODO item as done

---

In [1]:
import sqlite3

In [2]:
conn=sqlite3.connect('newtodo llist.db')

In [3]:
conn.execute('''CREATE TABLE IF NOT EXISTS todos( 
                         id INTEGER PRIMARY KEY, 
                         uid INTEGER DEFAULT NULL,
                         task text not null,
                         tags text,
                         status text)''')

In [4]:
conn.execute("INSERT INTO TODOS VALUES(1, 2,'task1','homework', 'done')")

In [5]:
conn.execute("INSERT INTO TODOS VALUES(3, 5,'task2','groceries', 'done')")

In [6]:
conn.execute("INSERT INTO TODOS VALUES(4, 7,'task3','groceries', 'notdone')")

In [7]:
for row in conn.execute('Select * from todos'):
    print(row)

(1, 2, 'task1', 'homework', 'done')
(3, 5, 'task2', 'groceries', 'done')
(4, 7, 'task3', 'groceries', 'notdone')

In [8]:
conn.execute('''CREATE TABLE IF NOT EXISTS users( 
                         uid INTEGER PRIMARY KEY, 
                         name text not null)''')

In [9]:
conn.execute("INSERT INTO users(uid, name) VALUES ('2','INSERT user1')")

In [10]:
conn.execute("INSERT INTO users(uid, name) VALUES ('5','INSERT user2')")

In [11]:
for row in conn.execute('Select * from users'):
    print(row)

(2, 'INSERT user1')
(5, 'INSERT user2')

In [12]:
import pandas as pd
sql= 'select * from todos'
pd.read_sql(sql, conn)

   id  uid   task       tags   status
0   1    2  task1   homework     done
1   3    5  task2  groceries     done
2   4    7  task3  groceries  notdone

In [13]:
import pandas as pd
sql= 'select * from users'
pd.read_sql(sql, conn)

   uid          name
0    2  INSERT user1
1    5  INSERT user2

In [14]:
sql= 'SELECT * from todos, users'
pd.read_sql(sql, conn)

   id  uid   task       tags   status  uid          name
0   1    2  task1   homework     done    2  INSERT user1
1   1    2  task1   homework     done    5  INSERT user2
2   3    5  task2  groceries     done    2  INSERT user1
3   3    5  task2  groceries     done    5  INSERT user2
4   4    7  task3  groceries  notdone    2  INSERT user1
5   4    7  task3  groceries  notdone    5  INSERT user2

In [15]:
sql= 'SELECT * from todos CROSS JOIN users'
pd.read_sql(sql, conn)

   id  uid   task       tags   status  uid          name
0   1    2  task1   homework     done    2  INSERT user1
1   1    2  task1   homework     done    5  INSERT user2
2   3    5  task2  groceries     done    2  INSERT user1
3   3    5  task2  groceries     done    5  INSERT user2
4   4    7  task3  groceries  notdone    2  INSERT user1
5   4    7  task3  groceries  notdone    5  INSERT user2

In [16]:
sql= 'SELECT * from todos CROSS JOIN users where todos.uid=users.uid'
pd.read_sql(sql, conn)

   id  uid   task       tags status  uid          name
0   1    2  task1   homework   done    2  INSERT user1
1   3    5  task2  groceries   done    5  INSERT user2

In [17]:
import pandas as pd
sql= 'SELECT * from todos LEFT JOIN users ON todos.uid=users.uid'
pd.read_sql(sql, conn)

   id  uid   task       tags   status  uid          name
0   1    2  task1   homework     done  2.0  INSERT user1
1   3    5  task2  groceries     done  5.0  INSERT user2
2   4    7  task3  groceries  notdone  NaN          None

Reference:-
(1) Question is taken from the source:https://github.com/IoannaTalasli/databases